---
kind: property
id: P:Autodesk.Revit.DB.ConnectorSet.IsEmpty
source: html/08bc4ea1-88cb-2bdf-c39b-c4b36b977589.htm
---
# Autodesk.Revit.DB.ConnectorSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.